const romanMap = {
    'あ': 'a', 'い': 'i', 'う': 'u', 'え': 'e', 'お': 'o',

    'か': 'ka', 'き': 'ki', 'く': 'ku', 'け': 'ke', 'こ': 'ko',

    'さ': 'sa', 'し': 'si', 'す': 'su', 'せ': 'se', 'そ': 'so',

    'た': 'ta', 'ち': 'ti', 'つ': 'tu', 'て': 'te', 'と': 'to',

    'な': 'na', 'に': 'ni', 'ぬ': 'nu', 'ね': 'ne', 'の': 'no',

    'は': 'ha', 'ひ': 'hi', 'ふ': 'hu', 'へ': 'he', 'ほ': 'ho',

    'ま': 'ma', 'み': 'mi', 'む': 'mu', 'め': 'me', 'も': 'mo',

    'や': 'ya', 'ゆ': 'yu', 'よ': 'yo',

    'ら': 'ra', 'り': 'ri', 'る': 'ru', 'れ': 're', 'ろ': 'ro',

    'わ': 'wa', 'を': 'wo', 'ん': 'nn',

    'が': 'ga', 'ぎ': 'gi', 'ぐ': 'gu', 'げ': 'ge', 'ご': 'go',

    'ざ': 'za', 'じ': 'zi', 'ず': 'zu', 'ぜ': 'ze', 'ぞ': 'zo',

    'だ': 'da', 'ぢ': 'di', 'づ': 'du', 'で': 'de', 'ど': 'do',

    'ば': 'ba', 'び': 'bi', 'ぶ': 'bu', 'べ': 'be', 'ぼ': 'bo',

    'ぱ': 'pa', 'ぴ': 'pi', 'ぷ': 'pu', 'ぺ': 'pe', 'ぽ': 'po',

    'きゃ': 'kya', 'きぃ': 'kyi', 'きゅ': 'kyu', 'きぇ': 'kye', 'きょ': 'kyo',

    'ぎゃ': 'gya', 'ぎぃ': 'gyi', 'ぎゅ': 'gyu', 'ぎぇ': 'gye', 'ぎょ': 'gyo',

    'しゃ': 'sya', 'しぃ': 'syi', 'しゅ': 'syu', 'しぇ': 'sye', 'しょ': 'syo',

    'じゃ': 'zya', 'じぃ': 'zyi', 'じゅ': 'zyu', 'じぇ': 'zye', 'じょ': 'zyo',
    
    'ちゃ': 'tya', 'ちぃ': 'tyi', 'ちゅ': 'tyu', 'ちぇ': 'tye', 'ちょ': 'tyo',

    'てゃ': 'tha', 'てぃ': 'thi', 'てゅ': 'thu', 'てぇ': 'the', 'てょ': 'tho',

    'でゃ': 'dha', 'でぃ': 'dhi', 'でゅ': 'dhu', 'でぇ': 'dhe', 'でょ': 'dho',

    'にゃ': 'nya', 'にぃ': 'nyi', 'にゅ': 'nyu', 'にぇ': 'nye', 'にょ': 'nyo',

    'ふぁ': 'fa', 'ふぃ': 'fi', 'ふぇ': 'fe', 'ふぉ': 'fo',

    'びゃ': 'bya', 'びぃ': 'byi', 'びゅ': 'byu', 'びぇ': 'bye', 'びょ': 'byo',

    'ぴゃ': 'pya', 'ぴぃ': 'pyi', 'ぴゅ': 'pyu', 'ぴぇ': 'pye', 'ぴょ': 'pyo',

    'みゃ': 'mya', 'みぃ': 'myi', 'みゅ': 'myu', 'みぇ': 'mye', 'みょ': 'myo',

    'りゃ': 'rya', 'りぃ': 'ryi', 'りゅ': 'ryu', 'りぇ': 'rye', 'りょ': 'ryo',

    'つぁ': 'tsa', 'つぃ': 'tsi', 'つぇ': 'tse', 'つぉ': 'tso',

    'ゔぁ': 'va', 'ゔぃ': 'vi', 'ゔ': 'vu', 'ゔぇ': 've', 'ゔぉ': 'vo',

    'ぁ': 'la', 'ぃ': 'li', 'ぅ': 'lu', 'ぇ': 'le', 'ぉ': 'lo',

    'ー': '-', '、': ',', '。': '.', '？': '?', '！': '!',

    '1': '1', '2': '2', '3': '3', '4': '4', '5': '5',

    '6': '6', '7': '7', '8': '8', '9': '9', '0': '0',
};
const romanMap2 = {
    'あ': 'a', 'い': 'yi', 'う': 'wu', 'え': 'e', 'お': 'o',

    'か': 'ca', 'き': 'ki', 'く': 'cu', 'け': 'ke', 'こ': 'co',

    'さ': 'sa', 'し': 'ci', 'す': 'su', 'せ': 'se', 'そ': 'so',

    'た': 'ta', 'ち': 'chi', 'つ': 'tsu', 'て': 'te', 'と': 'to',

    'な': 'na', 'に': 'ni', 'ぬ': 'nu', 'ね': 'ne', 'の': 'no',

    'は': 'ha', 'ひ': 'hi', 'ふ': 'fu', 'へ': 'he', 'ほ': 'ho',

    'ま': 'ma', 'み': 'mi', 'む': 'mu', 'め': 'me', 'も': 'mo',

    'や': 'ya', 'ゆ': 'yu', 'よ': 'yo',

    'ら': 'ra', 'り': 'ri', 'る': 'ru', 'れ': 're', 'ろ': 'ro',

    'わ': 'wa', 'を': 'wo', 'ん': 'xn',

    'が': 'ga', 'ぎ': 'gi', 'ぐ': 'gu', 'げ': 'ge', 'ご': 'go',

    'ざ': 'za', 'じ': 'ji', 'ず': 'zu', 'ぜ': 'ze', 'ぞ': 'zo',

    'だ': 'da', 'ぢ': 'di', 'づ': 'du', 'で': 'de', 'ど': 'do',

    'ば': 'ba', 'び': 'bi', 'ぶ': 'bu', 'べ': 'be', 'ぼ': 'bo',

    'ぱ': 'pa', 'ぴ': 'pi', 'ぷ': 'pu', 'ぺ': 'pe', 'ぽ': 'po',

    'きゃ': 'kya', 'きぃ': 'kyi', 'きゅ': 'kyu', 'きぇ': 'kye', 'きょ': 'kyo',

    'ぎゃ': 'gya', 'ぎぃ': 'gyi', 'ぎゅ': 'gyu', 'ぎぇ': 'gye', 'ぎょ': 'gyo',

    'しゃ': 'sha', 'しぃ': 'syi', 'しゅ': 'shu', 'しぇ': 'she', 'しょ': 'sho',

    'じゃ': 'ja', 'じぃ': 'jyi', 'じゅ': 'ju', 'じぇ': 'je', 'じょ': 'jo',

    'ちゃ': 'cya', 'ちぃ': 'cyi', 'ちゅ': 'cyu', 'ちぇ': 'cye', 'ちょ': 'cyo',

    'てゃ': 'tha', 'てぃ': 'thi', 'てゅ': 'thu', 'てぇ': 'the', 'てょ': 'tho',

    'でゃ': 'dha', 'でぃ': 'dhi', 'でゅ': 'dhu', 'でぇ': 'dhe', 'でょ': 'dho',

    'にゃ': 'nya', 'にぃ': 'nyi', 'にゅ': 'nyu', 'にぇ': 'nye', 'にょ': 'nyo',

    'ふぁ': 'fa', 'ふぃ': 'fi', 'ふぇ': 'fe', 'ふぉ': 'fo',

    'びゃ': 'bya', 'びぃ': 'byi', 'びゅ': 'byu', 'びぇ': 'bye', 'びょ': 'byo',

    'ぴゃ': 'pya', 'ぴぃ': 'pyi', 'ぴゅ': 'pyu', 'ぴぇ': 'pye', 'ぴょ': 'pyo',

    'みゃ': 'mya', 'みぃ': 'myi', 'みゅ': 'myu', 'みぇ': 'mye', 'みょ': 'myo',

    'りゃ': 'rya', 'りぃ': 'ryi', 'りゅ': 'ryu', 'りぇ': 'rye', 'りょ': 'ryo',

    'つぁ': 'tsa', 'つぃ': 'tsi', 'つぇ': 'tse', 'つぉ': 'tso',

    'ゔぁ': 'va', 'ゔぃ': 'vi', 'ゔ': 'vu', 'ゔぇ': 've', 'ゔぉ': 'vo',

    'ぁ': 'la', 'ぃ': 'lyi', 'ぅ': 'lu', 'ぇ': 'lye', 'ぉ': 'lo',

    'ー': '-', '、': ',', '。': '.', '？': '?', '！': '!',

    '1': '1', '2': '2', '3': '3', '4': '4', '5': '5',

    '6': '6', '7': '7', '8': '8', '9': '9', '0': '0',
};
const romanMap3 = {
    'あ': 'a', 'い': 'i', 'う': 'whu', 'え': 'e', 'お': 'o',

    'か': 'ka', 'き': 'ki', 'く': 'ku', 'け': 'ke', 'こ': 'ko',

    'さ': 'sa', 'し': 'shi', 'す': 'su', 'せ': 'se', 'そ': 'so',

    'た': 'ta', 'ち': 'chi', 'つ': 'tu', 'て': 'te', 'と': 'to',

    'な': 'na', 'に': 'ni', 'ぬ': 'nu', 'ね': 'ne', 'の': 'no',

    'は': 'ha', 'ひ': 'hi', 'ふ': 'hu', 'へ': 'he', 'ほ': 'ho',

    'ま': 'ma', 'み': 'mi', 'む': 'mu', 'め': 'me', 'も': 'mo',

    'や': 'ya', 'ゆ': 'yu', 'よ': 'yo',

    'ら': 'ra', 'り': 'ri', 'る': 'ru', 'れ': 're', 'ろ': 'ro',

    'わ': 'wa', 'を': 'wo', 'ん': 'nn',

    'が': 'ga', 'ぎ': 'gi', 'ぐ': 'gu', 'げ': 'ge', 'ご': 'go',

    'ざ': 'za', 'じ': 'zi', 'ず': 'zu', 'ぜ': 'ze', 'ぞ': 'zo',

    'だ': 'da', 'ぢ': 'di', 'づ': 'du', 'で': 'de', 'ど': 'do',

    'ば': 'ba', 'び': 'bi', 'ぶ': 'bu', 'べ': 'be', 'ぼ': 'bo',

    'ぱ': 'pa', 'ぴ': 'pi', 'ぷ': 'pu', 'ぺ': 'pe', 'ぽ': 'po',

    'きゃ': 'kya', 'きぃ': 'kyi', 'きゅ': 'kyu', 'きぇ': 'kye', 'きょ': 'kyo',

    'ぎゃ': 'gya', 'ぎぃ': 'gyi', 'ぎゅ': 'gyu', 'ぎぇ': 'gye', 'ぎょ': 'gyo',

    'しゃ': 'sya', 'しぃ': 'syi', 'しゅ': 'syu', 'しぇ': 'sye', 'しょ': 'syo',

    'じゃ': 'zya', 'じぃ': 'zyi', 'じゅ': 'zyu', 'じぇ': 'zye', 'じょ': 'zyo',

    'ちゃ': 'cha', 'ちぃ': 'tyi', 'ちゅ': 'chu', 'ちぇ': 'che', 'ちょ': 'cho',

    'てゃ': 'tha', 'てぃ': 'thi', 'てゅ': 'thu', 'てぇ': 'the', 'てょ': 'tho',

    'でゃ': 'dha', 'でぃ': 'dhi', 'でゅ': 'dhu', 'でぇ': 'dhe', 'でょ': 'dho',

    'にゃ': 'nya', 'にぃ': 'nyi', 'にゅ': 'nyu', 'にぇ': 'nye', 'にょ': 'nyo',

    'ふぁ': 'fa', 'ふぃ': 'fi', 'ふぇ': 'fe', 'ふぉ': 'fo',

    'びゃ': 'bya', 'びぃ': 'byi', 'びゅ': 'byu', 'びぇ': 'bye', 'びょ': 'byo',

    'ぴゃ': 'pya', 'ぴぃ': 'pyi', 'ぴゅ': 'pyu', 'ぴぇ': 'pye', 'ぴょ': 'pyo',

    'みゃ': 'mya', 'みぃ': 'myi', 'みゅ': 'myu', 'みぇ': 'mye', 'みょ': 'myo',

    'りゃ': 'rya', 'りぃ': 'ryi', 'りゅ': 'ryu', 'りぇ': 'rye', 'りょ': 'ryo',

    'つぁ': 'tsa', 'つぃ': 'tsi', 'つぇ': 'tse', 'つぉ': 'tso',

    'ゔぁ': 'va', 'ゔぃ': 'vi', 'ゔ': 'vu', 'ゔぇ': 've', 'ゔぉ': 'vo',

    'ー': '-', '、': ',', '。': '.', '？': '?', '！': '!',

    '1': '1', '2': '2', '3': '3', '4': '4', '5': '5',

    '6': '6', '7': '7', '8': '8', '9': '9', '0': '0',
};
